Revit 2027 API
BuiltInFailures.RebarFailures.StandardHookBendDiameterTooLarge Property
 Rebar Standard Hook Bend Diameter is too large.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StandardHookBendDiameterTooLarge { get; }
Public Shared ReadOnly Property StandardHookBendDiameterTooLarge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StandardHookBendDiameterTooLarge {
	FailureDefinitionId^ get ();
}
static member StandardHookBendDiameterTooLarge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace